app/Http/Controllers/DashboardController.php

    public function index()
    {
        $userInfo = Auth::user();
        $userArea = $userInfo['area_number'];

        $totalNewIssue = DB::table('issues')
            ->join('users', 'issues.user_id', '=', 'users.id')
            ->where('users.area_number',$userArea)
            ->where('issues.status',0)
            ->count();

        $totalSolvedIssue = DB::table('issues')
            ->join('users', 'issues.user_id', '=', 'users.id')
            ->where('users.area_number',$userArea)
            ->where('issues.status',1)
            ->count();

        $totalRejectedIssue = DB::table('issues')
            ->join('users', 'issues.user_id', '=', 'users.id')
            ->where('users.area_number',$userArea)
            ->where('issues.status',2)
            ->count();

        $recentRegisteredUser = User::orderBy('id','desc')->take(10)->get();

        $totalUser = User::count();
---
select count(*) as aggregate from `issues` inner join `users` on `issues`.`user_id` = `users`.`id` where `users`.`area_number` = 10 and `issues`.`status` = 0
select count(*) as aggregate from `issues` inner join `users` on `issues`.`user_id` = `users`.`id` where `users`.`area_number` = 10 and `issues`.`status` = 1
select count(*) as aggregate from `issues` inner join `users` on `issues`.`user_id` = `users`.`id` where `users`.`area_number` = 10 and `issues`.`status` = 2
select * from `users` order by `id` desc limit 10
select count(*) as aggregate from `users`

        // ->get()
        // ->pluck('status','total');

        $monthWiseIssues = Issue::select(DB::raw("COUNT(*) as count"), DB::raw("MONTHNAME(created_at) as month_name"))
                    ->whereYear('created_at', date('Y'))
                    ->groupBy(DB::raw("month_name"))
                    ->orderBy('id','ASC')
                    ->pluck('count', 'month_name');
---
select COUNT(*) as count, MONTHNAME(created_at) as month_name from `issues` where year(`created_at`) = '2023' group by month_name order by `id` asc