app/Http/Controllers/IssueController.php

select `users`.*, `issues`.* from `issues` inner join `users` on `issues`.`user_id` = `users`.`id` where `users`.`area_number` = 10 and `issues`.`status` = 0
---
    public function index()
    {
        $userInfo = Auth::user();
        $areaNumber = $userInfo['area_number'];
        // $issueList = Issue::with('raiser')->where('area_number',$areaNumber)->get();
        $issueList = DB::table('issues')
            ->join('users', 'issues.user_id', '=', 'users.id')
            ->select('users.*', 'issues.*')
            ->where('users.area_number',$areaNumber)
            ->where('issues.status',0)
            ->get();

select `users`.*, `issues`.* from `issues` inner join `users` on `issues`.`user_id` = `users`.`id` where `users`.`area_number` = 11 and `issues`.`status` = 1
---
    public function solvedIssues(){
        $userInfo = Auth::user();
        $areaNumber = $userInfo['area_number'];
        $issueList = DB::table('issues')
            ->join('users', 'issues.user_id', '=', 'users.id')
            ->select('users.*', 'issues.*')
            ->where('users.area_number',$areaNumber)
            ->where('issues.status',1)
            ->get();

select `users`.*, `issues`.* from `issues` inner join `users` on `issues`.`user_id` = `users`.`id` where `users`.`area_number` = 11 and `issues`.`status` = 2
---
    public function rejectedIssues(){
        $userInfo = Auth::user();
        $areaNumber = $userInfo['area_number'];
        $issueList = DB::table('issues')
            ->join('users', 'issues.user_id', '=', 'users.id')
            ->select('users.*', 'issues.*')
            ->where('users.area_number',$areaNumber)
            ->where('issues.status',2)
            ->get();

select * from `issues` where `user_id` = 301
---
    public function myIssue(){
        $userId = auth()->id();
        $issueList = Issue::where('user_id',$userId)->get();

insert into `issues` (`user_id`, `title`, `description`, `file_path`, `updated_at`, `created_at`) values (6, 'টেস্ট অভিযোগ', 'বিস্তারিত বর্ননা', '/storage/issue_attachments/6_1702832559_Ayesha Johora.pdf', '2023-12-17 17:02:39', '2023-12-17 17:02:39')
---
    public function store(Request $request)
    {
        $request->validate([
            'title'=>'required|string',
            'description'=>'required|required',
            'document'=>'required|mimes:csv,txt,xlx,xls,pdf|max:2048'
        ]);

        $newIssue = new Issue;
        $userId = auth()->id();
        $fileName = $userId.'_'.time().'_'.$request->document->getClientOriginalName();
        $filePath = $request->file('document')->storeAs('issue_attachments', $fileName, 'public');


        $newIssue->user_id = auth()->id();
        $newIssue->title = $request->title;
        $newIssue->description = $request->description;
        // $newIssue->document = $fileName;
        $newIssue->file_path = '/storage/' . $filePath;
        $newIssue->save();

select `user_id` from `issues` where `id` = '2' limit 1
select count(*) as aggregate from `issues` where `user_id` = 59 and `status` = 0
select count(*) as aggregate from `issues` where `user_id` = 59 and `status` = 1
select count(*) as aggregate from `issues` where `user_id` = 59 and `status` = 2
select count(*) as aggregate from `issues` where `user_id` = 59
select * from `issues` where `id` = '2'
---
    public function issueDetails($id){
        $issueId = $id;
        $userId = Issue::where('id',$issueId)->value('user_id');

        $pendingIssue_count = Issue::where('user_id', $userId)
                    ->where('status', 0)
                    ->count();

        $solvedIssue_count = Issue::where('user_id', $userId)
                    ->where('status', 1)
                    ->count();

        $rejectedIssue_count = Issue::where('user_id', $userId)
                    ->where('status', 2)
                    ->count();

        $totalIssue_count = Issue::where('user_id', $userId)
                    ->count();

        $issueCount = [
            'pending'=>$pendingIssue_count,
            'solved'=>$solvedIssue_count,
            'rejected'=>$rejectedIssue_count,
            'total'=>$totalIssue_count
        ];

        $issueDetails = Issue::with('raiser')->where('id',$issueId)->get()->first();