app/Http/Controllers/IssueController.php

select `users`.*, `issues`.* from `issues` inner join `users` on `issues`.`user_id` = `users`.`id` where `users`.`area_number` = 11
---
    public function index()
    {
        $userInfo = Auth::user();
        $areaNumber = $userInfo['area_number'];
        // $issueList = Issue::with('raiser')->where('area_number',$areaNumber)->get();
        $issueList = DB::table('issues')
            ->join('users', 'issues.user_id', '=', 'users.id')
            ->select('users.*', 'issues.*')
            ->where('users.area_number',$areaNumber)
            ->get();

select * from `issues` where `user_id` = 1
---
    public function myIssue(){
        $userId = auth()->id();
        $issueList = Issue::where('user_id',$userId)->get();

insert into `issues` (`user_id`, `title`, `description`, `file_path`, `updated_at`, `created_at`) values (1, 'another title', 'hello description', '/storage/issue_attachments/1_1674697423_Molla_Imtiaj_AhmedCV.pdf', '2023-01-26 01:43:43', '2023-01-26 01:43:43')
---
    public function store(Request $request)
    {
        $request->validate([
            'title'=>'required|string',
            'description'=>'required|required',
            'document'=>'required|mimes:csv,txt,xlx,xls,pdf|max:2048'
        ]);

        $newIssue = new Issue;
        $userId = auth()->id();
        $fileName = $userId.'_'.time().'_'.$request->document->getClientOriginalName();
        $filePath = $request->file('document')->storeAs('issue_attachments', $fileName, 'public');


        $newIssue->user_id = auth()->id();
        $newIssue->title = $request->title;
        $newIssue->description = $request->description;
        // $newIssue->document = $fileName;
        $newIssue->file_path = '/storage/' . $filePath;
        $newIssue->save();